
// 元数据映射
import type { Metadata } from '../types';

export const METADATA: Metadata = {
  classes: {
    0: '全部',
    1: '战士',
    2: '萨满祭司',
    3: '猎人',
    4: '圣骑士',
    5: '死亡骑士',
    6: '牧师',
    7: '潜行者',
    8: '法师',
    9: '术士',
    10: '德鲁伊',
    11: '恶魔猎手',
    12: '中立',
  },
  rarities: {
    0: '不限',
    1: '普通',
    2: '稀有',
    3: '史诗',
    4: '传说',
    5: '传说',
  },
  minionTypes: {
    0: '无',
    1: '野兽',
    2: '恶魔',
    3: '龙',
    4: '机械',
    5: '海盗',
    6: '鱼人',
    7: '图腾',
    8: '亡灵',
    9: '元素',
    10: '纳迦',
    11: '野猪人',
    12: '德莱尼',
    13: '纳鲁',
    14: '希尔瓦娜斯',
    15: '古树',
    16: '洛阿神灵',
    17: '石像鬼',
    18: '元素',
  },
  cardSets: {},
};

